# Typical Data Transformations in Pandas

- projection
- selection
- aggregation
- join 
- concat
- loop over

In [22]:
import pandas as pd

df1 = pd.DataFrame( { 'name' : [ 'abby','bette','chris','dave'], 'gpa' : [ 3.5, 3.0, 4.0, 3.0 ], 'age' : [18, 19, 18,20] })
df2 = pd.DataFrame( { 'name' : [ 'abby','bette','chris','dave', 'ed' ], 'major' : ['business', 'compsci', 'business', 'compsci', 'infosci'] })

In [23]:
# projection
df1[[ 'name', 'age']]

    name  age
0   abby   18
1  bette   19
2  chris   18
3   dave   20

In [9]:
# selection
df1[ df1.gpa > 3.4 ]

    name  gpa  age
0   abby  3.5   18
2  chris  4.0   18

In [15]:
# lambda, apply function to row
def makeolder(age):
    return age+1

df1.apply( lambda row: makeolder(row['age']), axis=1)

0    19
1    20
2    19
3    21
dtype: int64

In [18]:
#join inner outer
pd.merge(df1, df2, how="inner", left_on="name", right_on="name")

    name  gpa  age     major
0   abby  3.5   18  business
1  bette  3.0   19   compsci
2  chris  4.0   18  business
3   dave  3.0   20   compsci

In [26]:
# aggregate
df1['gpa'].mean()

3.375

In [27]:
# group by
df2.groupby("major").count()

          name
major
business     2
compsci      2
infosci      1

In [33]:
# loop over
for index, row in df1.iterrows():
    print(index, row['name'], row['age'])

0 abby 18
1 bette 19
2 chris 18
3 dave 20

In [40]:
# concatentate
pd.concat([df1,df2])

    name  gpa   age     major
0   abby  3.5  18.0       NaN
1  bette  3.0  19.0       NaN
2  chris  4.0  18.0       NaN
3   dave  3.0  20.0       NaN
0   abby  NaN   NaN  business
1  bette  NaN   NaN   compsci
2  chris  NaN   NaN  business
3   dave  NaN   NaN   compsci
4     ed  NaN   NaN   infosci